; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v3 ?v8)
             (pred_2 ?v13 ?v9)
             (pred_3 ?v3 ?v9)
             (pred_10 ?v2 ?v3 )
	     (pred_8 ?v3)
             (pred_1 ?v4)
             (pred_9 ?v13)
             (pred_12 ?v9)
             (pred_11 ?v3)
             (pred_4 ?v13)
             (pred_6 ?v3)
             (pred_7 ))



(:action op_3
:parameters (?v11 ?v5 ?v12 ?v7)
:precondition (and (pred_1 ?v11) (pred_1 ?v5) (pred_9 ?v12) (pred_12 ?v7)
          (pred_5 ?v11 ?v5) (pred_2 ?v12 ?v7)
                   (pred_3 ?v5 ?v7) (pred_8 ?v11) 
                   (pred_11 ?v5) (pred_4 ?v12))
:effect (and  (pred_6 ?v5) (not (pred_11 ?v5))))


(:action op_1
:parameters (?v11 ?v10)
:precondition (and (pred_1 ?v11) (pred_1 ?v10)
               (pred_8 ?v11) (pred_5 ?v11 ?v10) (pred_6 ?v10))
:effect (and (pred_8 ?v10) (not (pred_8 ?v11))))

(:action op_5
:parameters (?v11 ?v12)
:precondition (and (pred_1 ?v11) (pred_9 ?v12) 
                  (pred_8 ?v11) (pred_10 ?v12 ?v11) (pred_7 ))
:effect (and (pred_4 ?v12)
   (not (pred_10 ?v12 ?v11)) (not (pred_7 ))))


(:action op_4
:parameters (?v11 ?v1 ?v6)
:precondition (and (pred_1 ?v11) (pred_9 ?v1) (pred_9 ?v6)
                  (pred_8 ?v11) (pred_4 ?v6) (pred_10 ?v1 ?v11))
:effect (and (pred_4 ?v1) (pred_10 ?v6 ?v11)
        (not (pred_4 ?v6)) (not (pred_10 ?v1 ?v11))))

(:action op_2
:parameters (?v11 ?v12)
:precondition (and (pred_1 ?v11) (pred_9 ?v12) 
                  (pred_8 ?v11) (pred_4 ?v12))
:effect (and (pred_7 ) (pred_10 ?v12 ?v11) (not (pred_4 ?v12)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_19 obj_14 obj_13 obj_08 obj_15 obj_07 obj_02 obj_05 obj_09 obj_10 obj_01 obj_12 obj_04 obj_18 obj_03 obj_17
    obj_11 obj_16
    obj_06 obj_20
    )

    (:init
       (pred_7)

       (pred_1 obj_19)
       (pred_1 obj_14)
       (pred_1 obj_13)
       (pred_1 obj_08)
       (pred_1 obj_15)
       (pred_1 obj_07)
       (pred_1 obj_02)
       (pred_1 obj_05)
       (pred_1 obj_09)
       (pred_1 obj_10)
       (pred_1 obj_01)
       (pred_1 obj_12)
       (pred_1 obj_04)
       (pred_1 obj_18)
       (pred_1 obj_03)
       (pred_1 obj_17)
       (pred_12 obj_11)
       (pred_12 obj_16)
       (pred_9 obj_06)
       (pred_9 obj_20)

       (pred_5 obj_19 obj_15)
       (pred_5 obj_19 obj_14)
       (pred_5 obj_14 obj_07)
       (pred_5 obj_14 obj_13)
       (pred_5 obj_14 obj_19)
       (pred_5 obj_13 obj_02)
       (pred_5 obj_13 obj_08)
       (pred_5 obj_13 obj_14)
       (pred_5 obj_08 obj_05)
       (pred_5 obj_08 obj_13)
       (pred_5 obj_15 obj_09)
       (pred_5 obj_15 obj_07)
       (pred_5 obj_15 obj_19)
       (pred_5 obj_07 obj_10)
       (pred_5 obj_07 obj_02)
       (pred_5 obj_07 obj_14)
       (pred_5 obj_07 obj_15)
       (pred_5 obj_02 obj_01)
       (pred_5 obj_02 obj_05)
       (pred_5 obj_02 obj_13)
       (pred_5 obj_02 obj_07)
       (pred_5 obj_05 obj_12)
       (pred_5 obj_05 obj_08)
       (pred_5 obj_05 obj_02)
       (pred_5 obj_09 obj_04)
       (pred_5 obj_09 obj_10)
       (pred_5 obj_09 obj_15)
       (pred_5 obj_10 obj_18)
       (pred_5 obj_10 obj_01)
       (pred_5 obj_10 obj_07)
       (pred_5 obj_10 obj_09)
       (pred_5 obj_01 obj_03)
       (pred_5 obj_01 obj_12)
       (pred_5 obj_01 obj_02)
       (pred_5 obj_01 obj_10)
       (pred_5 obj_12 obj_17)
       (pred_5 obj_12 obj_05)
       (pred_5 obj_12 obj_01)
       (pred_5 obj_04 obj_18)
       (pred_5 obj_04 obj_09)
       (pred_5 obj_18 obj_03)
       (pred_5 obj_18 obj_10)
       (pred_5 obj_18 obj_04)
       (pred_5 obj_03 obj_17)
       (pred_5 obj_03 obj_01)
       (pred_5 obj_03 obj_18)
       (pred_5 obj_17 obj_12)
       (pred_5 obj_17 obj_03)
       (pred_11 obj_05)
       (pred_11 obj_10)
       (pred_3  obj_05 obj_11)
       (pred_3  obj_10 obj_16)
       (pred_6 obj_19)
       (pred_6 obj_14)
       (pred_6 obj_13)
       (pred_6 obj_08)
       (pred_6 obj_15)
       (pred_6 obj_07)
       (pred_6 obj_02)
       (pred_6 obj_09)
       (pred_6 obj_01)
       (pred_6 obj_12)
       (pred_6 obj_04)
       (pred_6 obj_18)
       (pred_6 obj_03)
       (pred_6 obj_17)

       (pred_2  obj_06 obj_11)
       (pred_2  obj_20 obj_16)
       (pred_10 obj_06 obj_15)
       (pred_10 obj_20 obj_18)
       (pred_8 obj_13)
    )

    (:goal (and
       (pred_10 obj_20 obj_04)
    ))
(:constraints
  (always (not (pred_8 obj_01)))
)
)

; plan
1. (op_1 obj_13 obj_02)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_02)
   goals met: 0 of 1
2. (op_1 obj_02 obj_07)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_07)
   goals met: 0 of 1
3. (op_1 obj_07 obj_15)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_15)
   goals met: 0 of 1
4. (op_5 obj_15 obj_06)
   deleted: (pred_10 obj_06 obj_15) (pred_7)
   added: (pred_4 obj_06)
   goals met: 0 of 1
5. (op_1 obj_15 obj_09)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_09)
   goals met: 0 of 1
6. (op_1 obj_09 obj_04)
   deleted: (pred_8 obj_09)
   added: (pred_8 obj_04)
   goals met: 0 of 1
7. (op_2 obj_04 obj_06)
   deleted: (pred_4 obj_06)
   added: (pred_7) (pred_10 obj_06 obj_04)
   goals met: 0 of 1
8. (op_1 obj_04 obj_18)
   deleted: (pred_8 obj_04)
   added: (pred_8 obj_18)
   goals met: 0 of 1
9. (op_5 obj_18 obj_20)
   deleted: (pred_10 obj_20 obj_18) (pred_7)
   added: (pred_4 obj_20)
   goals met: 0 of 1
10. (op_1 obj_18 obj_04)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_04)
   goals met: 0 of 1
11. (op_4 obj_04 obj_06 obj_20)
   deleted: (pred_4 obj_20) (pred_10 obj_06 obj_04)
   added: (pred_4 obj_06) (pred_10 obj_20 obj_04)
   goals met: 1 of 1
